import style from "./style/style.module.scss";

const MainAllText = () => {
  return (
    <div className={style.main_text_block}>
      <div className={style.main_text_previe}>
        <h2>Святкування The International 2023</h2>
      </div>

      <div className={style.main_text_h3}>
        <h3>
          Це кіберспортивне оновлення має щось для кожного — від фанатів професійної сцени до
          звичайних гравців.
        </h3>
      </div>

      <div className={style.main_text_background}></div>

      <div className={style.main_text_secendText}>
        <p>
          Незалежно від того, чи ви схвильовано стежите за кожною секундою всіх матчів на The
          International, чи взагалі не чули, що хтось заробляє цією грою собі на життя, і просто
          хочете спокійно порозважатися: це оновлення має дещо для вас.
        </p>

        <p>
          Ви — шанувальник кіберспорту? Створюйте власну команду професійних гравців у покращеній{" "}
          <span>фентезі-лізі</span>. Любите аналітику? Занурюйтеся у{" "}
          <span>випробування Оракула</span> й робіть прогнози на сітку. Можливо ви в захваті від
          ігор, у які грає сестра вашої бабусі? Що ж, цього року ми маємо ще й <span>бінґо</span>!
        </p>

        <p>
          А якщо вам не подобається це все? Якщо вам подобаєтеся лише ви самі? Є щось і для вас:{" "}
          <span>вітрина профілю</span>. Ваш профіль тепер стане пам’ятником вам і ви, якщо захочете,
          зможете показати там будь-які предмети і здобутки за всю вашу ігрову історію.
        </p>
      </div>
    </div>
  );
};

export default MainAllText;
